/**
 * Типові помилки
 *
 * - Звернення до змінної до її оголошення
 * - Перевизначення значення для змінної оголошеної через const
 * - Обращение по неправильному імени змінної
 *
 */
//!=========================================
// const username = 'Mango';
// console.log(username);
//!=========================================
// let age = 20;

// const price = 200;
// price = 250;
//!=========================================

// const userName = 'Vasya';
// console.log(username);

//!=========================================

// const pi = 3.14;
// pi = 25;
