/**
 * Функции
 *
 * - Оголошення та виклик функції
 * - Параметри та аргументи
 * - Повернення значення
 */
//!=========================================

// function part1() {
//   console.log('1) Кидай мясо у кастрюлю');
//   console.log('2) Чисти картоплю');
//   console.log('3) Кидай картоплю');
//   console.log('4) Кидай картоплю');
// }

// function part2() {
//   console.log('5) Кидай картоплю');
//   console.log('6) Кидай картоплю');
//   console.log('7) Кидай картоплю');
// }

// function myRecipe() {
//   part1();
//   part2();
// }

// debugger;
// myRecipe();

//!=========================================

// function myDay(currentDay) {
//   console.log('\n\n====================');
//   console.log('1) застелити ліжко');
//   console.log('2) почитстити зуби');
//   console.log('3) поснідати');
//   console.log(`4) забірати рюкзак на ${currentDay}`);
//   console.log('5) піти до школи');
//   console.log('6) повернутись зі школи');
//   console.log('7) відпочинок');
//   console.log('====================');
// }

//!=========================================
// myDay('Понеділок');
// myDay('Вівторок');

//!=========================================

// function sayHello(firstname, lastname, city) {
//   console.log(`Вітаємо ${firstname} ${lastname} у місті ${city}`);
// }
// sayHello('Василь', 'Володимирович', 'Львів');
//!=========================================
//? RETURN у функціях

// const y = 100;

// function foo() {
//   const x = 10;
//   console.log(x, y); // 10, 100
// }

// function sayHello() {
//   const x = 25;
//   const y = 50;
//   console.log(x, y); // 25, 50
// }

// foo();
// sayHello();

//!=========================================

// const width = parseInt('25px');
// const width2x = width * 2;
// console.log(width2x);
//!=========================================

// function foo(x, y) {
//   const sum = x + y;
//   console.log(sum);
// }

// foo(5, 7);
//!=========================================
// function foo(x, y) {
//   return 17;
// }
// console.log(foo(10, 7));
// const res = foo(10, 7);
// console.log(res * 2);

//!=========================================
//!=========================================
//!=========================================
//!=========================================
//!=========================================

// function getFirstLetter(word) {
//   const firstLetter = word[0];
//   return firstLetter;
// }

//!=========================================
// Задачі для практики JavaScript

// Задача-31 Напишіть функцію, яка приймає число num. Функція повинна
// повернути булеве значення true, якщо num більше 10. В іншому випадку
// false.

// function task1(num) {
//   const isGT10 = num > 10;
//   return isGT10;
// }

// console.log(task1(25));
// console.log(task1(5));
//!=========================================
// Задача-32 Напишіть функцію, яка приймає рядок str. Функція повинна
// повернути true, якщо довжина рядка більша за 5. Інакше повернути false.

// function task2(str) {
//   const isValidLength = str.length > 6;
//   return isValidLength;
// }
// console.log(task2('qwerty'));
// console.log(task2('MySuperPuperPassword'));

//!=========================================
// Задача-33 Напишіть функцію, яка приймає число num. Функція повинна
// повернути true, якщо число ділиться на 5 без остачі. Інакше повернути
// false.

// Задача-34 Напишіть функцію, яка приймає рядок str. Функція повинна
// повернути true, якщо остання літера рядка дорівнює “a”. Інакше повернути
// false.

// Задача-35 Напишіть функцію, яка приймає два числа num1 та num2. Функція
// повинна повернути true, якщо їх сума більша за 100. Інакше повернути
// false.

// Задача-36 Напишіть функцію, яка приймає рядок str. Функція повинна
// повернути true, якщо рядок починається з літери “b”. Інакше повернути
// false.

// Задача-37 Напишіть функцію, яка приймає число num. Функція повинна
// повернути true, якщо число менше 0. Інакше повернути false.

// Задача-38 Напишіть функцію, яка приймає рядок str. Функція повинна
// повернути true, якщо довжина рядка дорівнює 3. Інакше повернути false.

// Задача-39 Напишіть функцію, яка приймає два числа num1 та num2. Функція
// повинна повернути true, якщо їх добуток більше 50. Інакше повернути
// false.

// Задача-40 Напишіть функцію, яка приймає рядок str. Функція повинна
// повернути true, якщо рядок містить літеру “x”. Інакше повернути false.

// Задача-41 Напишіть функцію, яка приймає число num. Функція повинна
// повернути true, якщо num менше або дорівнює 10. Інакше повернути false.

// Задача-42 Напишіть функцію, яка приймає рядок str. Функція повинна
// повернути true, якщо перша і остання літера однакові. Інакше повернути
// false.

// Задача-43 Напишіть функцію, яка приймає два числа num1 та num2. Функція
// повинна повернути true, якщо num1 + num2 дорівнює 50. Інакше повернути
// false.

// Задача-44 Напишіть функцію, яка приймає число num. Функція повинна
// повернути true, якщо число ділиться на 3. Інакше повернути false.

// Задача-45 Напишіть функцію, яка приймає рядок str. Функція повинна
// повернути true, якщо довжина рядка менша за 4. Інакше повернути false.
